[
  {
    "dashboard": "Temporizzatore Pomodoro",
    "description": "La Tecnica del Pomodoro è un popolare metodo di gestione del tempo. Questo progetto prevede la creazione di un'app timer che faciliti sessioni di lavoro mirate con brevi pause, utilizzando la capacità di Vue di gestire intervalli di tempo e interazioni con gli utenti.",
    "columns": [
      {
        "name": "Obbligatori",
        "tasks": [
          {
            "title": "Gestione durata",
            "description": "Consentire agli utenti di impostare la durata delle sessioni di lavoro e delle pause (considerare la possibilità di fornire opzioni predefinite basate sulla Tecnica del Pomodoro).",
            "id": 1
          },
          {
            "title": "Feedback visivo",
            "description": "Implementare un timer che faccia un conto alla rovescia visivo, indicando il tempo rimanente all'interno di una sessione di lavoro o di una pausa.",
            "id": 2
          },
          {
            "title": "Gestione timer",
            "description": "Include funzionalità per l'avvio, la pausa e il ripristino del timer rispettando la schedulazione",
            "id": 3
          },
          {
            "title": "Notifica audio/visiva",
            "description": "Fornire una notifica audio o visiva al termine di una sessione di lavoro o di una pausa",
            "id": 4
          }
        ]
      },
      {
        "name": "Facoltativi",
        "tasks": [
          {
            "title": "Timer multipli",
            "description": "Implementare la possibilità di tenere attivi più timer contemporaneamente",
            "id": 6
          },
          {
            "title": "Modifica timer attivo",
            "description": "Includere funzionalità per modificare il tempo del timer mentre quest'ultimo è attivo",
            "id": 7
          }
        ]
      }
    ]
  },
  {
    "dashboard": "Blog semplice",
    "description": "Costruire un blog ti consente di sperimentare la gestione dei contenuti dove gli utenti possono visualizzare i post del blog mentre un utente privilegiato può aggiungere nuovi post",
    "columns": [
      {
        "name": "Obbligatori",
        "tasks": [
          {
            "title": "Visualizzazione dei post",
            "description": "Visualizza un elenco di post del blog con titoli, riepiloghi e immagini potenzialmente in primo piano",
            "id": 11
          },
          {
            "title": "Gestione post",
            "description": "Crea una pagina dedicata per la creazione e la modifica di nuovi post del blog (senza integrazione backend)",
            "id": 12
          }
        ]
      },
      {
        "name": "Facoltativi",
        "tasks": [
          {
            "title": "Login",
            "description": "Inserire una pagina di login (non serve un'effettiva chiamata ad un servizio di login)",
            "id": 16
          },
          {
            "title": "Post per utente",
            "description": "Una volta creata la pagina di login, ogni utente avrà i suoi post personali",
            "id": 17
          },
          {
            "title": "Post verso altri utenti",
            "description": "Implementare la possibilita di creare dei post sulla pagina di un altro utente",
            "id": 18
          }
        ]
      }
    ]
  },
  {
    "dashboard": "E-commerce",
    "description": "Costruire una pagina che rappresenti un sito di e-commerce.",
    "columns": [
      {
        "name": "Obbligatori",
        "tasks": [
          {
            "title": "Elenco oggetti disponibili",
            "description": "Visualizza un elenco di oggetti disponibili con titoli, riepiloghi e immagini potenzialmente in primo piano.",
            "id": 21
          },
          {
            "title": "Carrello",
            "description": "Costruire il carrello per l’aggiunta di nuovi elementi e la rimozione di elementi già presenti a carrello",
            "id": 22
          },
          {
            "title": "Descrizione prodotto",
            "description": "Creare una pagina di descrizione del prodotto",
            "id": 26
          }
        ]
      },
      {
        "name": "Facoltativi",
        "tasks": [
          {
            "title": "Checkout",
            "description": "Create pagina di checkout, ovvero di chiusura dell'ordine attribuendo un codice univoco all'ordine eseguito",
            "id": 27
          },
          {
            "title": "Login",
            "description": "Inserire una pagina di login (non serve un'effettiva chiamata ad un servizio di login)",
            "id": 28
          },
          {
            "title": "Carrello per utente",
            "description": "Una volta creata la pagina di login, ogni utente avrà il suo carrello personale",
            "id": 29
          }
        ]
      }
    ]
  }
]
